#Importações, Funções, Variáveis, Dados, etc.

import time
import os
import sqlite3

def limpar():
    os.system('cls')
    os.system('clear')

def carregando():
    limpar()
    print("\nCarregando...")
    time.sleep(1)
    limpar()


#Introdução
print("""
     ███████╗██╗███████╗████████╗███████╗███╗   ███╗ █████╗     
     ██╔════╝██║██╔════╝╚══██╔══╝██╔════╝████╗ ████║██╔══██╗    
     ███████╗██║███████╗   ██║   █████╗  ██╔████╔██║███████║    
     ╚════██║██║╚════██║   ██║   ██╔══╝  ██║╚██╔╝██║██╔══██║    
     ███████║██║███████║   ██║   ███████╗██║ ╚═╝ ██║██║  ██║    
     ╚══════╝╚═╝╚══════╝   ╚═╝   ╚══════╝╚═╝     ╚═╝╚═╝  ╚═╝                                                                                                                                                       
                        ██████╗ ███████╗    
                        ██╔══██╗██╔════╝     
                        ██║  ██║█████╗       
                        ██║  ██║██╔══╝      
                        ██████╔╝███████╗    
                        ╚═════╝ ╚══════╝     
██████╗██╗  ██╗ █████╗ ███╗   ███╗ █████╗ ██████╗  ██████╗ ███████╗  
██╔════╝██║  ██║██╔══██╗████╗ ████║██╔══██╗██╔══██╗██╔═══██╗██╔════╝
██║     ███████║███████║██╔████╔██║███████║██║  ██║██║   ██║███████╗
██║     ██╔══██║██╔══██║██║╚██╔╝██║██╔══██║██║  ██║██║   ██║╚════██║ 
╚██████╗██║  ██║██║  ██║██║ ╚═╝ ██║██║  ██║██████╔╝╚██████╔╝███████║ 
╚═════╝╚═╝  ╚═╝╚═╝  ╚═╝╚═╝     ╚═╝╚═╝  ╚═╝╚═════╝  ╚═════╝ ╚══════╝
       
                        < Sistema de Chamados >
""")

time.sleep(1)

print("""
Bem-vindo ao Sistema de Chamados! Este sistema foi desenvolvido para facilitar
a gestão e resolução de chamados em sua organização. Com ele, você pode criar,
acompanhar e resolver chamados de forma eficiente, garantindo que as solicitações
sejam atendidas de maneira rápida e organizada.
""")

time.sleep(1)

input("\n  Pressione Enter para continuar...")

#Menu Principal

carregando()
while True:
    print("""
         ███╗   ███╗███████╗███╗   ██╗██╗   ██╗
         ████╗ ████║██╔════╝████╗  ██║██║   ██║
         ██╔████╔██║█████╗  ██╔██╗ ██║██║   ██║
         ██║╚██╔╝██║██╔══╝  ██║╚██╗██║██║   ██║
         ██║ ╚═╝ ██║███████╗██║ ╚████║╚██████╔╝
         ╚═╝     ╚═╝╚══════╝╚═╝  ╚═══╝ ╚═════╝ 
                                      
██████╗ ██████╗ ██╗███╗   ██╗ ██████╗██╗██████╗  █████╗ ██╗     
██╔══██╗██╔══██╗██║████╗  ██║██╔════╝██║██╔══██╗██╔══██╗██║     
██████╔╝██████╔╝██║██╔██╗ ██║██║     ██║██████╔╝███████║██║     
██╔═══╝ ██╔══██╗██║██║╚██╗██║██║     ██║██╔═══╝ ██╔══██║██║     
██║     ██║  ██║██║██║ ╚████║╚██████╗██║██║     ██║  ██║███████╗
╚═╝     ╚═╝  ╚═╝╚═╝╚═╝  ╚═══╝ ╚═════╝╚═╝╚═╝     ╚═╝  ╚═╝╚══════╝
                                                                
                    < Menu Principal >
""")
    
    print("""
[1] - Criar Chamado
[2] - Acompanhar Chamado
[3] - Resolver Chamado
[4] - Sair
""")
    
    menu_opcoes = input(" Selecione uma opção desejada: ")

    if menu_opcoes == "1":
        carregando()
        print("""
         ██████╗██████╗ ██╗ █████╗  ██████╗ █████╗  ██████╗ 
        ██╔════╝██╔══██╗██║██╔══██╗██╔════╝██╔══██╗██╔═══██╗
        ██║     ██████╔╝██║███████║██║     ███████║██║   ██║
        ██║     ██╔══██╗██║██╔══██║██║     ██╔══██║██║   ██║
        ╚██████╗██║  ██║██║██║  ██║╚██████╗██║  ██║╚██████╔╝
       ╚═════╝╚═╝  ╚═╝╚═╝╚═╝  ╚═╝ ╚═════╝╚═╝  ╚═╝ ╚═════╝ 
                                                    
                        ██████╗ ███████╗
                        ██╔══██╗██╔════╝
                        ██║  ██║█████╗  
                        ██║  ██║██╔══╝  
                        ██████╔╝███████╗
                        ╚═════╝ ╚══════╝
                
 ██████╗██╗  ██╗ █████╗ ███╗   ███╗ █████╗ ██████╗  ██████╗ ███████╗
██╔════╝██║  ██║██╔══██╗████╗ ████║██╔══██╗██╔══██╗██╔═══██╗██╔════╝
██║     ███████║███████║██╔████╔██║███████║██║  ██║██║   ██║███████╗
██║     ██╔══██║██╔══██║██║╚██╔╝██║██╔══██║██║  ██║██║   ██║╚════██║
╚██████╗██║  ██║██║  ██║██║ ╚═╝ ██║██║  ██║██████╔╝╚██████╔╝███████║
╚═════╝╚═╝  ╚═╝╚═╝  ╚═╝╚═╝     ╚═╝╚═╝  ╚═╝╚═════╝  ╚═════╝ ╚══════╝
                                                                    
                    <  Criação de Chamados  >
""")
        print("<--------==========( Dados do Usuário )=========-------->\n")

        input(" Digite o nome do solicitante: ")

        print("\n<--------==========( Dados do Problema )=========-------->\n")

        input(" Digite o título do chamado: ")

        input(" Digite a descrição do chamado: ")

        input(" Digite a prioridade do chamado (Baixa, Média, Alta): ").lower()

        input(" Digite o Status do chamado (Aberto, Fechado): ")

    elif menu_opcoes == "2":
        print("")



    
    elif menu_opcoes == "3":
        print("")





    elif menu_opcoes == "4":
        limpar()
        print("\nSaindo do sistema...")
        time.sleep(3)
        break